Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/air_travel/air_transport_regulation.html.txt.tmx
Source language: en
Languages: ga

source: Civil air transport (including commercial and private air services) in Ireland is regulated by the Department of Transport, Tourism and Sport
ga: Rialaíonn An Roinn Iompair, Turasóireachta agus Spóirt iompar aeir in Éirinn

source: The European Union (EU) has a liberalised air transport market, meaning that there are no restrictions on frequency, flights or routes that airlines of Member States fly within the EU/European Economic Area (EEA)
ga: Tá margadh iompair aeir léirscaoilte san Aontas Eorpach (A.E.), 'sé sin le rá nach bhfuil srian ar bith ar mhinicíocht, eitiltí, nó bealaí a eitlíonn aerlínte na mballstát taobh istigh de Cheantar Eacnamaíochta na hEorpa. (CEE)

source: The liberalised air transport market in the EU has meant more frequent flights, greater availability, further destinations, lower fares and increased choice for the traveller
ga: De bharr an mhargaidh iompair aeir léirscaoilte san AE, bíonn eitiltí níos minice, tuilleadh ar fáil, tuilleadh ceann scríbe, táillí níos lú agus níos mó rogha ag an dtaistealaí

source: Airlines from countries outside of the EU/EEA must request permission each time they wish to fly to, from or over Ireland and these requests are forwarded in writing to the Department of Transport, Tourism and Sport where they are examined to ensure compliance with the highest standards of safety, airworthiness and insurance. (Military air transport in Ireland is regulated by the Department of Defence)
ga: Ní foláir d'aerlínte ó thíortha taobh amuigh den AE/CEE cead a fháil gach uair a bhfuil siad ag iarraidh eitilt go hÉirinn, ó Éirinn nó trasna na hÉireann, agus cuirtear na hiarratais seo ar aghaidh i scríbhinn chuig An Roinn Iompair, Turasóireachta agus Spóirt áit a scrúdaítear iad chun a bheith cinnte go gcloíonn siad leis an gcaighdéan sábháilteachta, acmhainne eitleoireachta agus árachais is airde

source: There are a total of 9 airports in Ireland
ga: Tá 9 aerfort ar fad in Éirinn

source: Three of these airports - Dublin, Cork and Shannon - are owned by the Irish government and operated on its behalf by separate airport authorities
ga: Trí cinn de na haerfoirt - Baile Átha Cliath, Corcaigh, agus An tSionainn - atá ar úinéireacht ag an rialtas na hÉireann agus gach oibrítear ar a shon ag údaráis aerfoirt ar leith

source: (That is, Dublin, Cork, and Shannon Airport Authorities). The other Irish airports at Waterford, Knock, Galway, Sligo, Donegal and Kerry are privately owned
ga: (Is é sin na hÚdaráis Aerfort do Bhaile Átha Cliath, do Chorcaigh, agus do na Sionainne) Tá na haerfoirt eile i bPort Láirge, Cnoc Mhuire, Gaillimh, Sligeach, Dún na nGall agus Ciarraí faoi úinéireacht phríobháideach

source: Under Regulation (EC) No 1107/2006 airport authorities are responsible for ensuring that an intending passenger with reduced mobility receives the necessary assistance from designated points of arrival at the airport to the point of boarding the aircraft
ga: Faoi Rialachán (CE) Uimh. 1107/2006 tá dualgas ar údarás an aerfoirt deimhin a dhéanamh de go bhfaighidh an t-ábhar paisinéara faoi mhíchumas luaineachta an cúnamh a theastaíonn uaidh as pointí ainmnithe teachta chun an aerfoirt nó go rachaidh sé ar bord an eitleáin

source: There is a similar provision for passengers who are landing at an EU airport
ga: Tá a shamhail d’fhoráil i bhfeidhm maidir le paisinéirí atá ag tuirlingt in aerfort san AE

source: The Commission for Aviation Regulation is the National Enforcement Body for this Regulation in Ireland
ga: Is é an Coimisiún um Rialáil Eitlíochta an Comhlacht Forfheidhmithe Náisiúnta le haghaidh an Rialachán seo in Éirinn

source: If you are travelling to/from an airport in Ireland, you should notify your airline at least 48 hours in advance if you require any special facilities
ga: Má tá tú ag taisteal go/ó aerfort stáit in Éirinn, ba cheart duit d'aerlíne a chur ar an eolas 48 uair roimh ré má tá áiseanna ar leith ag teastáil uait

source: Air accidents and incidents within Ireland
ga: Timpistí aeir agus eachtraí taobh istigh d'Éire

source: The Air Accident Investigation Unit is located at the Department of Transport and has responsibility for investigating all aircraft accidents and incidents within Ireland
ga: Tá an tAonad Fiosraithe faoi Thimpistí Aeir lonnaithe sa Roinn Iompair, Turasóireachta agus Spóirt agus tá sé freagrach as gach timpist agus eachtra aeir in Éirinn a fhiosrú

source: Reports of all air accidents, incidents and investigations within Ireland are available to download or by post and you can register to receive e-mail notifications of new postings on the Unit's website
ga: Is féidir tuairiscí faoi na timpistí aeir, eachtraí agus scrúdaithe ar fad in Éirinn a íoschóipeáil nó a fháil tríd an bpost agus d'fhéadfá fógraí ríomh-phoist a fháil faoi iontrálacha nua ar shuíomh idirlín an Aonaid ach clarú leis

source: The Irish Aviation Authority (IAA) is a state agency that has responsibility for a range of operational and regulatory functions and services relating to the safety and technical aspects of civil aviation in Ireland
ga: Is gníomhaireacht stáit é Údarás Eitleoireachta na hÉireann (ÚEÉ) atá freagrach as réimse dualgas agus seirbhísí feidhmiúla agus rialacháin a bhaineann le gnéithe sábháilteacha agus teicniúla eitleoireachta sibhialta in Éirinn

source: The IAA, for example, operates the Air Traffic Control Centres around Ireland and monitor Ireland's airspace
ga: Mar shampla, oibríonn ÚEÉ na hIonaid Rialaithe Tráchta Aeir timpeall na hÉireann agus déanann sé monatóireacht ar aerspás na hÉireann

source: In addition, the IAA issues licences to aircraft pilots, registers aircraft and ensures that civil aviation in Ireland adheres to the highest international standards of safety
ga: Chomh maith leis sin, eisíonn ÚEÉ ceadúnais do phiolótaí eitleáin, claraíonn sé eitleáin, agus déanann sé cinnte go gcloíonn eitleoireacht shibhialta in Éirinn leis na caighdeáin idirnáisiúnta sábháilteachta is airde

source: Commission for Aviation Regulation
ga: Coimisiún um Rialú Eitleoireachta

source: The Commission for Aviation Regulation is responsible for setting the maximum level of airport and aviation terminal services charges and also has an important role in licensing the travel trade in Ireland
ga: Is é an Coimisiún um Rialú Eitleoireachta atá freagrach as uasmhéid na dtáillí aerfoirt agus críochfoirt eitleoireachta a leagan síos, agus tá ról tábhachtach aige chomh maith i gclarú an tionscail taistil in Éirinn

source: It grants licences to both tour operators and travel agents
ga: Tugann sé ceadúnais d'fhoirne turais agus gníomhairí taistil

source: As part of this function, the Commission administers a bonding scheme
ga: Mar chuid den dualgas seo, eagraíonn an Coimisiún scéim bhannaithe

source: The Commission also licenses Irish airlines, approves groundhandling services providers under regulations implementing EU legislation and assesses capacity at Irish airports and decides the manner in which take-off and landing slots are administered
ga: Ceadaíonn an Coimisiún aerlínte Éireannacha freisin, agus soláthraithe seirbhíse láimhseála ar an dtalamh faoi rialacháin a chuireann reachtaíocht AE i bhfeidhm agus a mheasann acmhainn ag aerfoirt na hÉireann agus a dhéanann cinneadh faoin mbealach ina eagraítear sealanna éirí de thalamh agus tuirlingthe

source: The Commission also has a consumer protection role
ga: Tá ról cosaint tomhaltóirí ag an gCoimisiún chomh maith

source: It enforces EU legislation covering air passenger rights and the provision of assistance to passengers with reduced mobility
ga: Forfheidhmiú sé reachtaíocht an AE a chlúdaíonn cearta paisinéirí aeir agus cúnamh a sholáthar do phaisinéirí faoi mhíchumas luaineachta
